#define _CRT_SECURE_NO_WARNINGS
#include <stdio.h>
#include <locale.h>

int main() {
	setlocale(LC_ALL, "RUS");
	float r2, r1;
	printf("Программа расчета сопротивления двух последовательных и параллельных резисторов, которые не равны нулю:");

	puts("\n\nВведите значение первого резистора(в Ом):"); // 1ое число
	scanf("%f", &r1);

	puts("\nВведите значение второго резистора(в Ом):"); // 2ое число
	scanf("%f", &r2);

	printf("\nОтвет:\nСопротивление при последовательном соеденение равно %.2f Ом \nСопротивление при параллельном соеденение равно %.2f Ом\n", r1+r2, (r1*r2)/(r1+r2));
	return 0;
}
